In [1]:
import pandas as pd

In [3]:
# comando .split() pode ser utilizado para criar listas com str
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [4]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [6]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [7]:
type(df['c1'])

pandas.core.series.Series

In [9]:
# utilizando colchetes duples e separando por v√≠rgulas podemos selecionar mais de uma coluna
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [10]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [12]:
# para selecionar todas as linhas inserimos :
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [13]:
# para selecionar a partir de uma linha e todas abaixo utilizamos index_linha:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [16]:
# para selecionar um intervalo de linhas definimos index_inicial:idex_final+1
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [17]:
# para selecionar linhas e colunas colocamos os filtros de colchetes em sequ√™ncia sendo linhas>colunas
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [20]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [19]:
# com o comando .loc podemos fazer os mesmo filtros, por√©m utilizando os r√≥tulos/nomes das linhas
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [21]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [22]:
# com o .loc podemos tamb√©m puxar valores de dentro de um df defindo sua localiza√ß√£o pelo inxex e coluna
df.loc['l1', 'c2']

2

In [23]:
# com o .iloc utilizamos os √≠ndeces tanto das linhas como das colunas para localizar informa√ß√µes o DF
df.iloc[0,1]

2

In [24]:
# com o .loc podemos tb remontar o df selecionando colunas e linhas espec√≠ficas
df.loc[['l3','l1'],['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [25]:
# o mesmo filtro feito com o .iloc
df.iloc[[2, 0],[3, 0]]

    c4  c1
l3  12   8
l1   4   1